using System;

namespace _07._Trekking_Mania
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Вход
            //От конзолата се четат поредица от числа, всяко на отделен ред:
            //•	На първия ред – броя на групите от катерачи – цяло число в интервала[1...1000]
            //•	За всяка една група на отделен ред – броя на хората в групата – цяло число в интервала[1...1000]


            int groups = int.Parse(Console.ReadLine());
            int climbers = 0;

            int musala = 0;
            int monblan = 0;
            int kilim = 0;
            int k2 = 0;
            int everest = 0;

            for (int i = 0; i < groups; i++)
            {
                int people = int.Parse(Console.ReadLine());
                climbers += people;

                if (people <= 5)
                {
                    musala += people;
                }
                else if (people <= 12)
                {
                    monblan += people;
                }
                else if (people <= 25)
                {
                    kilim += people;
                }
                else if (people <= 40)
                {
                    k2 += people;
                }
                else
                {
                    everest += people;
                }
            }

            Console.WriteLine($"{musala * 1.0 / climbers * 100:f2}%");
            Console.WriteLine($"{monblan * 1.0 / climbers * 100:f2}%");
            Console.WriteLine($"{kilim * 1.0 / climbers * 100:f2}%");
            Console.WriteLine($"{k2 * 1.0 / climbers * 100:f2}%");
            Console.WriteLine($"{everest * 1.0 / climbers * 100:f2}%");


            //Катерачи от цяла България се събират на групи и набелязват следващите върхове за изкачване. Според размера на групата, катерачите ще изкачват различни върхове.
            //•	Група до 5 човека – изкачват Мусала
            //•	Група от 6 до 12 човека – изкачват Монблан
            //•	Група от 13 до 25 човека – изкачват Килиманджаро
            //•	Група от 26 до 40 човека –  изкачват К2
            //•	Група от 41 или повече човека – изкачват Еверест
            //Да се напише програма, която изчислява процента на катерачите изкачващи всеки връх.




            //Изход
            //Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00 % и 100.00 % с точност до втората цифра след десетичната запетая.
            //•	Първи ред -процентът изкачващи Мусала
            //•	Втори ред – процентът изкачващи Монблан
            //•	Трети ред – процентът изкачващи Килиманджаро
            //•	Четвърти ред – процентът изкачващи К2
            //•	Пети ред – процентът изкачващи Еверест

        }
    }
}
